load-tests/artillery/spike-test.yml
config:
  target: "http://localhost:3000"
  plugins:
    metrics-by-endpoint: {}
  
  # Spike test - sudden increase in traffic
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Baseline"
    
    - duration: 30
      arrivalRate: 500  # Sudden spike
      name: "Spike"
    
    - duration: 60
      arrivalRate: 5
      name: "Recovery"

  http:
    timeout: 15
  
  ensure:
    maxErrorRate: 10  # Allow errors during spike

scenarios:
  - name: "Spike Test Scenario"
    weight: 100
    flow:
      - get:
          url: "/api/categories"
          expect:
            - statusCode: [200, 429, 500, 503]  # Allow rate limiting and server errors
      
      - get:
          url: "/api/services"
          expect:
            - statusCode: [200, 429, 500, 503]